[
  {
    "img": "ArielHuang.jpg",
    "fname" : "Dr. Ariel Huang (黃阿力)",
    "desc" : "Ariel used to play guitar. Now he mostly makes beats.\nWith the impression that music was either a compositional activity or a performative one, this switch in music practice was confusing because beat-making simply does not fit with this duality.\nDetermined to sort it out once and for all, he soon found out that this type of friction has historically persisted between institutionally-entrenched paradigms that are founded upon embodied modes of making sounds and the many types of electronic and computerised music-making practices that have emerged since.\nMaking a case for how an existentially grounded idea of ludomusicality is useful for addressing such complications, Ariel successfully defended his doctoral dissertation by 2022.\nAriel currently lectures on topics such as philosophy of technology and popular music studies at City University of Hong Kong and Hong Kong Baptist University.\nAriel also dabbled in projection mapping, kinetic sculpture-making, and other new media projects when pursuing an MFA in Creative Media. You can check out some videos of this stuff elsewhere on the site.\nhttps://arielmusics.com/"
  },
  {
    "img": "JLou.jpg",
    "fname" : "J Lou",
    "desc" : "J Lou is a content creator whose comedy videos have captivated millions around the globe. She is known for her videos highlighting her multicultural background and experiences, as well as appearing on multiple tv shows in Hong Kong. She is experienced in giving impactful talks as she has spoken at TEDx events four times prior, as well as speaking at Harvard University, Meta Summit and more."
  },
  {
    "img": "JeffreyAndrews.jpg",
    "fname" : "Jeffrey Andrews",
    "desc" : "An Indian of descent, Hong Kong-born and raised, and one of the first ethnic minority registered social workers in Hong Kong. Committed to helping refugees and minority rights, in 2014, he travelled to the United Nations in Geneva to speak about the issues of segregated schools. He has received The Secretary for Home Affairs' Commendation awarded in recognition of his dedicated service and outstanding contributions to the enhancement of racial harmony and integration in Hong Kong. Recently, he has been selected as 2019 JCI Top Outstanding young persons and also 2019 Cathay Pacific’s Change Makers award, and in 2020, his beloved football team Manchester United recognized him as one of 7 Global heroes. He has been with Christian Action’s Centre for Refugees in Chungking Mansions for 14 years."
  },
  {
    "img": "KevinPereira.jpg",
    "fname" : "Kevin Pereira",
    "desc" : "Kevin Pereira is currently a Managing Director at Blu Artificial Intelligence, a consulting firm that specialises in Artificial Intelligence. After growing up in Hong Kong, he started his career in Private Banking with Citi in New York. He then moved back to Hong Kong and joined Bank of New York Mellon’s Asset Management business, before pursuing his MBA. After business school, he worked at a technology startup in Myanmar that was building internet infrastructure which included fibre optic, cell towers and data centres. Kevin is also a Part-time lecturer at the University of Hong Kong (HKU), Hong Kong University of Science and Technology (HKUST), and CityU where he teaches classes related to the intersection of Artificial Intelligence and different areas of business such as Marketing and Finance.\nKevin graduated with a Bachelor of Science in Economics with concentrations in Finance, Management and Marketing from the Wharton School at the University of Pennsylvania. He also has an MBA from INSEAD."
  },
  {
    "img": "LambertChan.jpg",
    "fname" : "Lambert Chan",
    "desc" : "Lambert Chan is a seasoned CEO with expertise in branding, strategic marketing, business development and operations with almost 40 years of proven track record in highly competitive industries, including luxury retail, telecom, tourism, banking and NGO.\nHe is the Adjunct Professor and Deputy Programme Leader of Global Business at the City University of Hong Kong. Prior to his teaching engagement, Lambert was the Chief Executive of UNICEF HK and Executive Director & Deputy CEO of TSL Jewellery Group. He was also instrumental in the V-shaped rebound of the tourism industry after SARS when he served as the General Manager of the Hong Kong Tourism Board. Lambert is renowned for his creativity and strategic vision in launching two award-winning businesses, “1010” and One2Free when he was the youngest General Manager in the telecom sector.\nHe is a Council Member of Gerson Lehrman Group providing management consultancy services to MNCs. He also serves as the Chairman of the Board at the Youth Global Network, a social enterprise for divergent youths."
  },
  {
    "img": "PriyankaJain.jpg",
    "fname" : "Dr. Priyanka Jain",
    "desc" : "https://www.linkedin.com/in/priyankaj/\nWith a PhD in Urban Planning, Transport Economics and Public Policy, Dr. Priyanka Jain has worked as an Instructor in the City University of Hong Kong and as an Asst. Professor (PT) in the University of Hong Kong, before embarking into business and consulting.\nHer entrepreneurial debut was as the Director of AVA International, a Hong Kong based procurement company specialising in procurement of mobile telecom devices, computer devices and solutions. This then expanded into providing consultancy services in the field of Transport Planning, Public Transport Operations and Management.\nCurrently she is managing Trans-consult Asia Limited and serves as a director in its sister concern in India, Transconsult Pvt. Ltd.\nHer personal passion lies in acting and theatre, where she was the lead actor in an award winning Bengali film, \"Khanta\", acted in several Hindi and English productions in India and Hong Kong.\nSpecialties: Public Policy Analysis, Socio-Economic Analysis, Marketing, Product Development & Branding"
  }
]